app/views/dbs/show.html.erb

<h1><%= @db.name %></h1>
<% if @db.resources.any? %>
---
SELECT COUNT(*) FROM "resources" INNER JOIN "resource_dbs" ON "resources"."id" = "resource_dbs"."resource_id" WHERE "resource_dbs"."db_id" = ?  [["db_id", 1]]