app/views/languages/show.html.erb

<h1><%= @language.name %></h1>
<% if @language.resources.any? %>
---
SELECT "resources".* FROM "resources" INNER JOIN "resource_languages" ON "resources"."id" = "resource_languages"."resource_id" WHERE "resource_languages"."language_id" = ?  [["language_id", 3]]
SELECT COUNT(*) FROM "resources" INNER JOIN "resource_languages" ON "resources"."id" = "resource_languages"."resource_id" WHERE "resource_languages"."language_id" = ?  [["language_id", 3]]