app/views/projects/show.html.erb

                <tbody>
                  <% @project.resources.each do |resource| %>
---
SELECT "resources".* FROM "resources" WHERE "resources"."project_id" = ?  [["project_id", 1]]

                      <td><%= time_ago_in_words(resource.created_at) %> ago</td>
                      <td><% resource.languages.each do |language| %>
---
SELECT "languages".* FROM "languages" INNER JOIN "resource_languages" ON "languages"."id" = "resource_languages"."language_id" WHERE "resource_languages"."resource_id" = ?  [["resource_id", 5]]

                      <% end %></td>
                      <td><% resource.technologies.each do |technology| %>
---
SELECT "technologies".* FROM "technologies" INNER JOIN "resource_technologies" ON "technologies"."id" = "resource_technologies"."technology_id" WHERE "resource_technologies"."resource_id" = ?  [["resource_id", 5]]

                        <% end %></td>
                      <td><% resource.frameworks.each do |framework| %>
---
SELECT "frameworks".* FROM "frameworks" INNER JOIN "resource_frameworks" ON "frameworks"."id" = "resource_frameworks"."framework_id" WHERE "resource_frameworks"."resource_id" = ?  [["resource_id", 5]]