app/views/resources/_form.html.erb

    <div class="col-md-offset-2 col-md-8">
      <%= f.collection_check_boxes :language_ids,
                                    Language.all, :id, :name do |cb| %>
---
SELECT "languages".* FROM "languages"

    <div class="col-md-offset-2 col-md-8">
      <%= f.collection_check_boxes :technology_ids,
                                    Technology.all, :id, :name do |cb| %>
---
SELECT "technologies".* FROM "technologies"

    <div class="col-md-offset-2 col-md-8">
      <%= f.collection_check_boxes :framework_ids,
                                    Framework.all, :id, :name do |cb| %>
---
SELECT "frameworks".* FROM "frameworks"