app/views/resources/show.html.erb

    <dd><%= @resource.memo %></dd>
    <% if @resource.languages.any? %>
    <dt><strong><%= t("resources.show.languages") %>:</strong></dt>
    <dd><% @resource.languages.each do |language| %>
---
SELECT "languages".* FROM "languages" INNER JOIN "resource_languages" ON "languages"."id" = "resource_languages"."language_id" WHERE "resource_languages"."resource_id" = ?  [["resource_id", 1]]
SELECT  1 AS one FROM "languages" INNER JOIN "resource_languages" ON "languages"."id" = "resource_languages"."language_id" WHERE "resource_languages"."resource_id" = ? LIMIT ?  [["resource_id", 1], ["LIMIT", 1]]

    <%end%>
    <% if @resource.technologies.any? %>
---
SELECT "technologies".* FROM "technologies" INNER JOIN "resource_technologies" ON "technologies"."id" = "resource_technologies"."technology_id" WHERE "resource_technologies"."resource_id" = ?  [["resource_id", 1]]

    <% end %>
    <% if @resource.frameworks.any? %>
---
SELECT "frameworks".* FROM "frameworks" INNER JOIN "resource_frameworks" ON "frameworks"."id" = "resource_frameworks"."framework_id" WHERE "resource_frameworks"."resource_id" = ?  [["resource_id", 1]]