app/controllers/frameworks_controller.rb

    def create
      @framework = Framework.new(framework_params)

      respond_to do |format|
        if @framework.save
---
INSERT INTO "frameworks" ("name") VALUES (?)  [["name", "Test"]]

    def index
      @frameworks = Framework.all
---
SELECT "frameworks".* FROM "frameworks"

    def set_framework
      @framework = Framework.find(params[:id])
---
SELECT  "frameworks".* FROM "frameworks" WHERE "frameworks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]