app/controllers/languages_controller.rb

INSERT INTO "languages" ("name") VALUES (?)  [["name", "Ruby"]]
---
  def create
    @language = Language.new(language_params)

    respond_to do |format|
      if @language.save

UPDATE "languages" SET "name" = ? WHERE "languages"."id" = ?  [["name", "Javascript"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @language.update(language_params)

SELECT "languages".* FROM "languages"
---
  def index
    @languages = Language.all

SELECT  "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_language
    @language = Language.find(params[:id])