app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "description", "start_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Project 1"], ["description", "Project 1"], ["start_date", "2019-01-07"], ["created_at", "2019-01-07 16:23:11.332234"], ["updated_at", "2019-01-07 16:23:11.332234"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save