app/controllers/resources_controller.rb

SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_resource
      @resource = Resource.find(params[:id])