app/controllers/resources_controller.rb

  def index
    @resources = Resource.all
---
SELECT "resources".* FROM "resources"

  def new
    @resource = Resource.new
    @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def create
    @resource = Resource.new(resource_params)
    @projects = Project.all

    respond_to do |format|
      if @resource.save
---
SELECT  "projects".* FROM "projects" ORDER BY "projects"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "resources" ("url", "memo", "image", "document", "created_at", "updated_at", "name", "project_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @resource.update(resource_params)
---
UPDATE "resources" SET "image" = ?, "document" = ?, "updated_at" = ? WHERE "resources"."id" = ?  [["image", ""], ["document", ""], ["updated_at", "2019-01-05 18:50:08.034879"], ["id", 1]]

  def destroy
    @resource.destroy
---
DELETE FROM "resources" WHERE "resources"."id" = ?  [["id", 14]]

    def set_resource
      @resource = Resource.find(params[:id])
---
SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]