app/controllers/technologies_controller.rb

    def create
      @technology = Technology.new(technology_params)

      respond_to do |format|
        if @technology.save
---
INSERT INTO "technologies" ("name") VALUES (?)  [["name", "Test"]]

    def index
      @technologies = Technology.all
---
SELECT "technologies".* FROM "technologies"

    def set_technology
      @technology = Technology.find(params[:id])
---
SELECT  "technologies".* FROM "technologies" WHERE "technologies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]