app/views/frameworks/show.html.erb

<h1><%= @framework.name %></h1>
<% if @framework.resources.count != 0 %>
  <h4 align="center">Resouces' containing <%= @framework.name %></h4>
  <% @framework.resources.each do |resource| %>
---
SELECT "resources".* FROM "resources" INNER JOIN "resource_frameworks" ON "resources"."id" = "resource_frameworks"."resource_id" WHERE "resource_frameworks"."framework_id" = ?  [["framework_id", 1]]
SELECT COUNT(*) FROM "resources" INNER JOIN "resource_frameworks" ON "resources"."id" = "resource_frameworks"."resource_id" WHERE "resource_frameworks"."framework_id" = ?  [["framework_id", 1]]