app/views/technologies/show.html.erb

<h1><%= @technology.name %></h1>
<% if @technology.resources.count != 0 %>
  <h4 align="center">Resouces' containing <%= @technology.name %></h4>
  <% @technology.resources.each do |resource| %>
---
SELECT "resources".* FROM "resources" INNER JOIN "resource_technologies" ON "resources"."id" = "resource_technologies"."resource_id" WHERE "resource_technologies"."technology_id" = ?  [["technology_id", 1]]
SELECT COUNT(*) FROM "resources" INNER JOIN "resource_technologies" ON "resources"."id" = "resource_technologies"."resource_id" WHERE "resource_technologies"."technology_id" = ?  [["technology_id", 5]]