app/views/layouts/_navbar.html.erb

        <div class="dropdown-menu" aria-labelledby="navbarDropdown">
        <% Language.all.each do |language| %>
---
SELECT "languages".* FROM "languages"

        <div class="dropdown-menu" aria-labelledby="navbarDropdown">
        <% Technology.all.each do |technology| %>
---
SELECT "technologies".* FROM "technologies"

        <div class="dropdown-menu" aria-labelledby="navbarDropdown">
        <% Framework.all.each do |framework| %>
---
SELECT "frameworks".* FROM "frameworks"